class InterfaceMessages:
    """ Class for Interface Messages storing """

    def __init__(self, **kwargs):
        """
        Initializes InterfaceMessages object for convenience
        """
        for key, value in kwargs.items():
            self.__setattr__(key, value)


def prepare_messages():
    """
    Function with prepared ukrainian messages
    :return:
    """

    messages = {
        "greeting":
            "Доброго дня!",

        "menu_choices":
            "Виберіть одну з доступних опцій: \n"
            "0. Вийти з програми. \n"
            "1. Показати список. \n"
            "2. Ввести власноруч список дійсних чисел, заново або доповнивши. \n"
            "3. Згенерувати заново або догенерувати (ітератором/генератором) \n"
            "   список випадкових дійсних чисел заданого діапазону. \n"
            "4. Додати елемент в k-тий елемент списку власноруч. \n"
            "5. Вилучити зі списку k-тий елемент.\n"
            "6. Порахувати кількість унікальних входжень в списку.",

        "list_preservation_choices":
            "Виберіть дію зі списком: \n"
            "0. Нічого не робити, вийти. \n"
            "1. Стерти попередній список, якщо він є. \n"
            "2. Доповнити попередній список. \n"
            "Якщо попередній список відсутній, опції 1 і 2 просто створять новий.\n",

        "generator_choices":
            "Виберіть спосіб генерації: \n"
            "0. Не генерувати, вийти. \n"
            "1. Ітераторним класом. \n"
            "2. Генераторною функцією. \n",


        "query_input":
            lambda number: f"[{number}]: ",

        "wrong_query":
            "Даний запит некоректний. Будь-ласка, повторіть ще раз!\n",

        "exit_message":
            "Програма завершує свою роботу. До побачення!",

        "list_input":
            "Введіть елементи списку, це повинні бути дійсні числа.",

        "list_result":
            "Так виглядає утворений список:",

        "list_previous_output":
            "Так виглядає список перед модифікацією:",
        "list_output":
            "Так виглядає список після модифікації:",

        "list_size_mismatch":
            lambda missing:
            f"Деякі з введених Вами дані є записані у список. \n"
            f"Однак очікується, що Ви введете ще таку кількість коректних дійсних чисел: {missing}",

        "size_input":
            "Введіть розмір списку (ціле число більше нуля), який ви хочете ввести в результуючий.",

        "wrong_size":
            "Введені Вами дані не може бути розмірністю списку. \n",

        "range_input":
            "Введіть два числа a, b (a <= b) - діапазон для випадково згенерованих чисел.",

        "wrong_range":
            "Введені Вами дані є некоректного типу або формату. \n"
            "Введіть, будь-ласка два дійсних числа a, b (a <= b)!\n",

        "index_input":
            lambda size:
            f"Введіть одне число - індекс для модифікації списку. \n"
            f"Зауваження: нумерація списку починається з одиниці, розмірність списку: {size}.",

        "wrong_index":
            lambda size:
            "Введене Вами значення є некоректного типу або формату. \n"
            f"Вводьте, будь-ласка, ціле число від 1 до {size} включно!\n",

        "element_input":
            "Введіть, будь-ласка, одне дійсне число, яке ви хочете записати в список:",

        "wrong_element":
            "Ви не ввели одне дійсне число. Будь-ласка, введіть ОДНЕ дійсне число\n",

        "deleted_output":
            lambda element:
            f"Елемент \"{element}\" успішно видалено зі списку!",

        "task_output":
            lambda uniques:
            f"Кількість унікальних елементів у зв'язаному списку дорівнює {uniques}.",

        "erase_list":
            "\nПопередження: старий список буде видалено (назавжди)!"
    }

    return InterfaceMessages(**messages)
